brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/main.c
/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static bool on_generic_ble_evt(ble_evt_t * p_ble_evt)
{
    ret_code_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        // GHS - Should never happen
        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(m_connection_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {

            if (do_read_request(p_ble_evt))
                break;

            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } 
        break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

        default:
            // No implementation needed.
            return false;
    }
    return true;
}

static void print_data(unsigned char *data, unsigned short data_length)
{
    if(data_length > 0)
    {
        // All this crap is just to print the data being sent in 32-byte chunks
        int j = 0;
        int chunk = (data_length > 32) ? 32 : data_length;
        char buffer[104];
        while (true)
        {
            memset(buffer, 0, 104);
            if ((j + 32) > data_length)
            {
                chunk = data_length - j;
            }
            NRF_LOG_INFO("%s", (uint32_t)byteToHex(&data[j], buffer, " ", chunk));
            NRF_LOG_FLUSH();
            j = j + chunk;
            if (j >= data_length) break;
        }
    }
}

static ret_code_t send_data()
{
    if (global_send.data_length == 0 || !send_flag)   // Nothing to send
    {
        return NRF_SUCCESS;
    }
    ret_code_t             error_code;
    uint16_t               hvx_length;
    uint32_t               recordNum = 0;
    ble_gatts_hvx_params_t hvx_params;
    if(sd_mutex_acquire(&p_mutex) == NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
    {
        NRF_LOG_DEBUG("Mutex locked");
        return NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN;
    }
    int                    count = 1;   // For Debug informational output only
    //  Sole purpose of this if block is to print the data being sent - 
    //  -- well, add fragmentation header init and record number to that
    if (global_send.offset == 0 && send_flag)
    {
        recordNum = global_send.recordNumber;
        frag_header = ((frag_header & 0xFC) | 1); // 1111 1100 + 1
        NRF_LOG_INFO("=====> Sending %u bytes of data at time %u: ", global_send.data_length, getTicks());
        print_data(global_send.data, global_send.data_length);
    }
    send_flag = false;

    while(true)
    {
        unsigned short data_reduction = 0; // Reduction of data size sent due to fragment and record number headers
        bool insert_recordNumber = false;
        if (global_send.handle == m_ghs_bt_sig_live_data_not_handle.value_handle || global_send.handle == m_ghs_bt_sig_stored_data_not_handle.value_handle)
        {
            memset(tempBuf, 0, 512);
            if (ghs_abort // connection has been terminated by PHG
                || (m_connection_handle == BLE_CONN_HANDLE_INVALID))    // the connection has been killed
            {
                NRF_LOG_DEBUG("=====> Aborted or connection handle invalid");
                emptyQueue(queue);
                error_code = NRF_ERROR_INVALID_STATE;
                break;
            }
            if (global_send.handle == m_ghs_bt_sig_stored_data_not_handle.value_handle)  // If stored data 
            {
                if ((frag_header & 0x01) == 0x01)  // if first fragment
                {
                    insert_recordNumber = true;    // need to insert record number as well as fragment
                    data_reduction = 5;            // How much the actual data size being sent is reduced
                }
                else
                {
                    data_reduction = 1;
                }
            }
            else if (global_send.handle == m_ghs_bt_sig_live_data_not_handle.value_handle)
            {
                data_reduction = 1;
            }
            // If amount of data exceeds max size, send chunk sized length of data
            if (global_send.data_length - global_send.offset > global_send.chunk_size - data_reduction) //(mtu_size - OPCODE_LENGTH - HANDLE_LENGTH))
            {
                hvx_length = global_send.chunk_size; //(mtu_size - OPCODE_LENGTH - HANDLE_LENGTH);
            }
            // If the amount is less than that value set it to the amount left.
            else
            {
                frag_header = (frag_header | 2); // Add the 'last' fragment indicator
                hvx_length = global_send.data_length - global_send.offset + data_reduction;
            }
            frag_header = frag_header + 4;        // Now increment the fragment counter bits 2-7. Bits 0 and one are set appropriately.
            NRF_LOG_DEBUG("=====> Fragment # %u: Send %u bytes of %u total from offset %u at time %u. Data reduction: %u",
                count, hvx_length - data_reduction, global_send.data_length, global_send.offset, getTicks(), data_reduction);
            NRF_LOG_DEBUG("=====> Handle %u cp handle %u, stored handle %u, live handle %u", 
                global_send.handle, m_racp_handle.value_handle, m_ghs_bt_sig_stored_data_not_handle.value_handle,
                m_ghs_bt_sig_live_data_not_handle.value_handle);
            count++;

            hvx_params.handle = global_send.handle;
            uint8_t enable = (global_send.handle == m_ghs_bt_sig_live_data_not_handle.value_handle) ? 
                    cccdSet[LIVE_DATA_CCCD_INDEX] : cccdSet[STORED_DATA_CCCD_INDEX];
            if (enable == BLE_GATT_HVX_INVALID)
            {
                global_send.data_length = 0;
                global_send.offset = 0;
                global_send.data = NULL;
                global_send.handle = 0;
                emptyQueue(queue);
                error_code = NRF_SUCCESS;
                break;
            }
            hvx_params.type = enable;
            hvx_params.offset = 0; // global_send_offset;
            hvx_params.p_len = &hvx_length;
        
            // Insert headers

