brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/main.c
            if (insert_recordNumber)
            {
                // Here is the crap - I have to stick one extra byte at the start of this fragment and the record number, but record number only on first fragment.
                memcpy(&tempBuf[data_reduction], (unsigned char *)(global_send.data + global_send.offset), (hvx_length - data_reduction ));
                tempBuf[0] = frag_header;
                fourByteEncode(tempBuf, 1, recordNum);
            }
            else
            {
                // Here is the crap - I have to stick one extra byte at the start of this fragment.
                memcpy(&tempBuf[data_reduction], (unsigned char *)(global_send.data + global_send.offset), (hvx_length - data_reduction ));
                tempBuf[0] = frag_header;
            }
        }
        else // No fragmentation for control point indications
        {
            hvx_params.handle = global_send.handle;
            hvx_params.type = BLE_GATT_HVX_INDICATION;
            hvx_params.offset = 0;
            hvx_length = global_send.data_length;
            hvx_params.p_len = &hvx_length;
            memcpy(tempBuf, global_send.data, hvx_length);
        }
        hvx_params.p_data = tempBuf;

        // Send indication or notification
        NRF_LOG_DEBUG("=====> Sending fragment of %u bytes", hvx_length);
        print_data(tempBuf, hvx_length);
        error_code = sd_ble_gatts_hvx(m_connection_handle, &hvx_params);
        if (error_code == NRF_SUCCESS)
        {
            frag_header = (frag_header & 0xFE);
            // This is for notifications. We need to make sure all notifications are accounted for before indicating that the 
            // record is complete. So it increments here, and decrements in the BLE_EVT_TX_COMPLETE event. The event may
            // contain more than one packet sent.
            global_send.chunks_outstanding++;
            // Update the position in the buffer for the next send
            global_send.offset = global_send.offset + *hvx_params.p_len - data_reduction;
            // If that update exceeds the buffer size, we are done
            if (global_send.offset >= global_send.data_length)
            {
                NRF_LOG_DEBUG("=====> Entire package sent");
                error_code = NRF_SUCCESS;
                break;
            }
            // If an indication we need to wait for the BLE_GATTS_EVT_HVC before the next send
            if (hvx_params.type == BLE_GATT_HVX_INDICATION)
            {
                error_code = NRF_SUCCESS;
                break; // Wait for event
            }
            // We have more TX buffers so send the next hunk
            //NRF_LOG_DEBUG("=====> TX buffer still available");
            continue;
        }
        // This will only happen for indications. Here we simply loop on redoing the send calls
        // until the send goes, then we can advance the buffer and wait for the BLE_GATTS_EVT_HVC event.
        else if (error_code == NRF_ERROR_BUSY)  // Indications only
        {
            while (sd_ble_gatts_hvx(m_connection_handle, &hvx_params) == NRF_ERROR_BUSY);  // keep calling until not busy.
            frag_header = (frag_header & 0xFE);
            global_send.offset = global_send.offset + *hvx_params.p_len - 1;
            global_send.chunks_outstanding++;
            error_code = NRF_SUCCESS;
            break;    // Wait for event
        }
        // If we have no buffers, we have to wait for the BLE_EVT_TX_COMPLETE event and resend
        else if( error_code == NRF_ERROR_RESOURCES) // Notifications only
        {
            NRF_LOG_DEBUG("=====> No TX buffers; wait for event and resend.");
            //global_send.chunks_outstanding++;
            error_code = NRF_SUCCESS;
            break;
        }
        // Hopefully this does not happen.
        else
        {
            NRF_LOG_ERROR("=====> Failed doing the indication. Error code: 0x%02X", error_code);
            global_send.data_length = 0;
            global_send.offset = 0;
            global_send.data = NULL;
            global_send.handle = 0;
            emptyQueue(queue);
            break;
        }
    }
    sd_mutex_release(&p_mutex);
    return error_code;
}

static void createRacpResponse(uint8_t *response, uint16_t length)
{
    global_send.chunks_outstanding = 0;
    global_send.handle = m_racp_handle.value_handle;

    NRF_LOG_DEBUG("Response field non NULL: value 0x%x", *response);
    memcpy(cpResponse, response, length);
    global_send.data_length = length;

    global_send.data = cpResponse;
    global_send.offset = 0;
}

static void createCpResponse(uint8_t *response, uint16_t length)
{
    global_send.chunks_outstanding = 0;
    global_send.handle = m_ghs_bt_sig_cp_handle.value_handle;

    NRF_LOG_DEBUG("Response field non NULL: value 0x%x", *response);
    memcpy(cpResponse, response, length);
    global_send.data_length = length;

    global_send.data = cpResponse;
    global_send.offset = 0;
}

/**
  We assume there is some kind of interrupt triggered by the sensor that sends measurement data to this
  module. Those values are loaded into the struct s_MsmtData liveMsmt. Then this method is called to set
  up the global_send parameters.

  Live measurements can only be sent after the PHG has given the command to send live measurements.
 */
bool prepareMeasurements(s_MsmtGroupData *msmtGroupData, unsigned short recordNumber)
{
    if (                                      // If PHG has given the send live data command and
        m_connection_handle != BLE_CONN_HANDLE_INVALID   // the connection is valid and
        && hasEncrypted                                  // encryption has been done (if pairing is not supported, this is set to true)
        && ((cccdSet[LIVE_DATA_CCCD_INDEX] && live_data_mode) ||    // the live data characteristic has been enabled and live data is active
            (cccdSet[STORED_DATA_CCCD_INDEX] && racp_mode)))   // the stored data characteristic has been enabled and live data is not active
    {
        global_send.data = msmtGroupData->data;

