brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("Physical update request: rx phys %d, tx phys %d",
                p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.rx_phys,
                p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.tx_phys);
            const ble_gap_phys_t* phys = &p_ble_evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys;
            uint32_t result = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, phys);
            NRF_LOG_DEBUG("Result %d", result);
            used = true;
        }

        case BLE_GAP_EVT_PHY_UPDATE:
        {
            NRF_LOG_DEBUG("Physical update update:rx phys %d, tx phys %d,",
                p_ble_evt->evt.gap_evt.params.phy_update.rx_phy,
                p_ble_evt->evt.gap_evt.params.phy_update.tx_phy);
            used = true;
        }
        break;
    }
    return used;
}

static void handle_data_characteristics()
{
    global_send.handle = 0;
    NRF_LOG_DEBUG("----> Record is done");
    #if (USES_STORED_DATA == 1)

    if (((global_send.current_command & 0xFF) == RACP_GET_RECORDS) ||
         ((global_send.current_command & 0xFF) == RACP_GET_COMBINED))
    {
        global_send.number_of_groups--;
        if (global_send.number_of_groups > 0 && global_send.number_of_groups <= NUMBER_OF_STORED_MSMTS)
        {
            NRF_LOG_DEBUG("----> Sending stored data element %u", (numberOfStoredMsmtGroups - global_send.number_of_groups));
            sendStoredMeasurements(numberOfStoredMsmtGroups - global_send.number_of_groups);
        }
        else if (!stored_data_done_sent)
        {
            NRF_LOG_INFO("----> All stored data sent");
            if (racp_request == RACP_GET_RECORDS) // Old RACP
            {
                createRacpResponse(GET_RECORDS_RESP_SUCCESS, 4);
            }
            else // New RACP with number of records sent
            {
                GET_COMBO_RECORDS_RESP_SUCCESS[2] = (num_records_to_send & 0xFF);
                GET_COMBO_RECORDS_RESP_SUCCESS[3] = ((num_records_to_send >> 8)& 0xFF);
                GET_COMBO_RECORDS_RESP_SUCCESS[4] = 0;
                GET_COMBO_RECORDS_RESP_SUCCESS[5] = 0;
                createRacpResponse(GET_COMBO_RECORDS_RESP_SUCCESS, 6);
            }
            global_send.number_of_groups = 0;
            stored_data_done_sent = true;
            send_flag = true;
        }
    }
    #elif (USES_STORED_DATA == 2)
        if ((global_send.current_command & 0xFF) == GHSCP_SET_LIVE_DATA_MODE)
        {
            global_send.number_of_groups--;
            if (global_send.number_of_groups > 0 && global_send.number_of_groups <= NUMBER_OF_STORED_MSMTS)
            {
                NRF_LOG_DEBUG("----> Sending temp stored data element %u", (numberOfStoredMsmtGroups - global_send.number_of_groups));
                sendStoredMeasurements(numberOfStoredMsmtGroups - global_send.number_of_groups);
            }
            else if (!stored_data_done_sent)
            {
                NRF_LOG_INFO("----> All temp stored data sent");
                stored_data_done_sent = true;
            }
        }
    #endif
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    uint32_t              err_code;
    ble_gap_conn_params_t connParams;

    if (p_ble_evt == NULL)
    {
        return;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:

            NRF_LOG_INFO("Connection event received at time %u.", getTicks());
            m_connection_handle = p_ble_evt->evt.gap_evt.conn_handle;
            global_send.chunk_size = (mtu_size - OPCODE_LENGTH - HANDLE_LENGTH);
            frag_header = 0xFC;
            if (saveDataBuffer != NULL)
            {
                // Calling sd_ble_gatts_sys_attr_set with CCCD info
                err_code = sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gap_evt.conn_handle, saveDataBuffer,
                    saveDataLength, BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("Failed updating persistent sys attr info. Error code: 0x%02X", err_code);
                    free(saveDataBuffer);
                    saveDataBuffer = NULL;
                    saveDataLength = 0;
                }
            }
            #if defined(S140) || defined (S113)
                // Request update of data length
                ble_gap_data_length_limitation_t limitation;
                ble_gap_data_length_params_t server;
                server.max_rx_octets = 27;
                server.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                server.max_tx_octets = NRF_SDH_BLE_GAP_DATA_LENGTH; // Set in sdk_config.h
                server.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
                err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &server, &limitation);
                NRF_LOG_DEBUG("sd_ble_gap_data_length_update attempt Result %d", err_code);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("RX limit %d  tx limit %d", limitation.rx_payload_limited_octets, limitation.tx_payload_limited_octets);
                }
            #endif
            bsp_board_led_off(ADVERTISING_LED);
            bsp_board_led_on(CONNECTED_LED);

            break;

        // Service change indication acknolwedged
        case BLE_GATTS_EVT_SC_CONFIRM:
            NRF_LOG_DEBUG("Service change acknowledged at time %u", getTicks());
            break;

        // Added just for info
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            connParams = p_ble_evt->evt.gap_evt.params.conn_param_update.conn_params;
            NRF_LOG_DEBUG("Connection parameters update at time %u: min: %d max: %d supervision timeout: %d slave latency: %d ",
                getTicks(),
                connParams.min_conn_interval, connParams.max_conn_interval, 
                connParams.conn_sup_timeout, connParams.slave_latency);
            break;
                
            case BLE_GATTC_EVT_TIMEOUT:
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_GAP_EVT_DISCONNECTED:
        {
            NRF_LOG_INFO("Disconnected at time %u", getTicks());
            #if (USES_LIVE_DATA == 1)
                app_timer_stop(m_ghs_live_data_timer_id);
            #endif
            uint16_t currentSysDataLength;
            unsigned char *currentSysDataBuffer;
            bsp_board_led_off(ADVERTISING_LED);
            bsp_board_led_off(CONNECTED_LED);
            bsp_board_led_off(MSMT_DATA_LED);
            bsp_board_led_on(DISCONNECTED_LED);
            ghs_abort = true;

            // call twice; once to get the size of the data
            // create the buffer,
            // call a second time to load the data into the buffer
            sd_ble_gatts_sys_attr_get(p_ble_evt->evt.gap_evt.conn_handle, NULL, &currentSysDataLength,
                BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
            // Do we need to upDate flash?
            if (currentSysDataLength > 0) // This should always have something!!
            {
                // Lets get the current system info
                currentSysDataBuffer = calloc(1, currentSysDataLength * sizeof(uint8_t));
                err_code = sd_ble_gatts_sys_attr_get(p_ble_evt->evt.gap_evt.conn_handle, currentSysDataBuffer, &currentSysDataLength,
                    BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_DEBUG("Failed getting persistent sys attr info. Error code: 0x%02X", err_code);
                    // TODO  do something here
                }
                bool isEqual = ((currentSysDataLength == saveDataLength)
                                && (saveDataLength > 0 && saveDataBuffer != NULL)
                                && (memcmp(saveDataBuffer, currentSysDataBuffer, saveDataLength) == 0)
                                && stored_msmts_same);
                if (isEqual)
                {
                    NRF_LOG_INFO("Flash write not needed; data is equal to what is already in flash");
                    flash_write_needed = false;
                }
                else
                {
                    if (saveDataBuffer != NULL)
                    {
                        free (saveDataBuffer);
                    }
                    saveDataBuffer = calloc (1, currentSysDataLength *sizeof(uint8_t));
                    saveDataLength = currentSysDataLength;
                    memcpy(saveDataBuffer, currentSysDataBuffer, saveDataLength);
                }
                free(currentSysDataBuffer);
            }
            else
            {
                flash_write_needed = !stored_msmts_same;
            }
            m_connection_handle = BLE_CONN_HANDLE_INVALID;
            if (flash_write_needed)
            {
                latestTimeStamp = getRtcTicks();
                saveKeysToFlash(&keys, &saveDataBuffer, &saveDataLength, cccdSet, &noOfCccds);
                stored_msmts_same = true;
                break;
            }
            reset_specializations();
            #if (USE_DK == 0)
                restartAdv = true;
            #endif
        }
        break;

